src/cf/Catalogs/ПользовательскиеИстории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПользовательскиеИстории</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.БизнесЦели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Персоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимыйФункционал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Функциональности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевоеДействие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючевыеДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаУчастияВПроекте</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормаУчастияВПроекте</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ценность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метрики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метрики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФиче</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФичи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КритерииДостижения</Name>
					<Comment>Как понять что цель достигнура</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ПользовательскиеИстории/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПодсказку();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодсказку()
	ШаблонHTML =
	"<html>
	|<head>
	|  <style>
	|   p {
	|    font-family: 'Courier New'; 
	|    font-size: 12pt;
	|   }
	|  </style>
	| </head>	
	|<body>
	|<p>#Текст</p>
	|</body>
	|</html>";
	
	Текст = "Чтобы добиться цели #Цель, #Роль будет #ВыполнятьКлючевоеДействие и для этого он(она) хочет #НеобходимыйФункционал";
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Текст = СтрЗаменить(Текст, "#Цель", "<strong>" + Объект.Владелец + "</strong>");		
	Иначе
		Текст = СтрЗаменить(Текст, "#Цель", "<strong>?</strong>");		
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Роль) Тогда
		Текст = СтрЗаменить(Текст, "#Роль", "<strong>" + Объект.Роль + "</strong>");		
	Иначе
		Текст = СтрЗаменить(Текст, "#Роль", "<strong>роль</strong>");		
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.КлючевоеДействие) Тогда
		Текст = СтрЗаменить(Текст, "#ВыполнятьКлючевоеДействие", "<strong>" + Объект.КлючевоеДействие + "</strong>");		
	Иначе
		Текст = СтрЗаменить(Текст, "#ВыполнятьКлючевоеДействие", "<strong>выполнять ключевое действие</strong>");		
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.НеобходимыйФункционал) Тогда
		Текст = СтрЗаменить(Текст, "#НеобходимыйФункционал", "<strong>" + Объект.НеобходимыйФункционал + "</strong>");		
	Иначе
		Текст = СтрЗаменить(Текст, "#НеобходимыйФункционал", "<strong>необходимый функционал</strong>");		
	КонецЕсли;
	
	Текст = СтрЗаменить(ШаблонHTML, "#Текст", Текст);
	
	Подсказка = Текст;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокФункционала(Автоматически = Ложь)
	Если Автоматически Тогда
		Объект.Заголовок = Объект.НеобходимыйФункционал;
		
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ПодвердитьАвтоопределениеЗаголовкаЗавершение", ЭтотОбъект), "Взять в качестве заголовка определение необходимой функциональности?", РежимДиалогаВопрос.ДаНет);	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодвердитьАвтоопределениеЗаголовкаЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Заголовок = Объект.НеобходимыйФункционал;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РольПриИзменении(Элемент)
	ОбновитьПодсказку();
КонецПроцедуры

&НаКлиенте
Процедура КлючевоеДействиеПриИзменении(Элемент)
	ОбновитьПодсказку();
КонецПроцедуры

&НаКлиенте
Процедура НеобходимыйФункционалПриИзменении(Элемент)
	ОбновитьПодсказку();
	ОбновитьЗаголовокФункционала(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбщегоНазначениеКлиент.УбратьСКонцовПробелы(Объект.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименованиеИзНеобходимогоФункционала(Команда)
	ОбновитьЗаголовокФункционала();	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФичеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("ОткрытьФичуЗавершение", ЭтотОбъект), Объект.ПутьКФиче);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФичуЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Feature открыта во внешней программе.";
	Сообщение.Сообщить();	
КонецПроцедуры
